In [1]:
import pandas as pd
import numpy as np
import scipy

In [2]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 9435-FCE6

 Directory of C:\Users\Prince\Desktop\Upgrad\Hypothesis Testing

26-03-2024  14:40    <DIR>          .
26-03-2024  14:40    <DIR>          ..
26-03-2024  14:40    <DIR>          .ipynb_checkpoints
26-03-2024  10:27            12,995 2-sample mean test.xlsx
26-03-2024  10:34            43,402 2-sample proportion test.xlsx
26-03-2024  14:40                72 Untitled.ipynb
               3 File(s)         56,469 bytes
               3 Dir(s)  16,218,083,328 bytes free

### 1- Sample Mean Test

In [5]:
df = pd.read_excel('2-sample mean test.xlsx',sheet_name=' 1-sample mean test')
df.head()

   Unnamed: 0  Commute time of employees   Hypothesised Mean Time
0         NaN                          37                    35.0
1         NaN                          64                     NaN
2         NaN                          43                     NaN
3         NaN                          32                     NaN
4         NaN                          23                     NaN

In [7]:
df.drop(['Unnamed: 0','Hypothesised Mean Time'],inplace=True,axis=1)

In [8]:
df.head()

   Commute time of employees
0                          37
1                          64
2                          43
3                          32
4                          23

In [9]:
scipy.stats.ttest_1samp(df['Commute time of employees '],35)

TtestResult(statistic=-1.7233018724723084, pvalue=0.09479631478752118, df=31)

- So here our p-value is 0.094
- H0: Mean of sample is equal to the population mean
- since p-value> alpha value i.e 0.05 we will fail to reject the null hypothesis.

### 2 sample t-test :Paired

In [11]:
df = pd.read_excel('2-sample mean test.xlsx',sheet_name="2-sample mean test - Paired")
df.head()

,Unnamed: 0,Commute time on Day 1,Commute Time on Day 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,NaN,27,23,NaN,NaN,NaN,NaN
1,NaN,43,42,NaN,NaN,NaN,NaN
2,NaN,34,39,NaN,NaN,NaN,NaN
3,NaN,24,23,NaN,NaN,NaN,NaN
4,NaN,31,37,NaN,NaN,NaN,NaN

In [13]:
df = df[['Commute time on Day 1','Commute Time on Day 2']]
df.head()

   Commute time on Day 1  Commute Time on Day 2
0                     27                     23
1                     43                     42
2                     34                     39
3                     24                     23
4                     31                     37

In [19]:
scipy.stats.ttest_ind(df['Commute time on Day 1'],df['Commute Time on Day 2'])

TtestResult(statistic=0.14171787003575112, pvalue=0.8877623550344126, df=62.0)

- H0: 2 independent samples have identical average i.e u1-u2=0
- H1: u1-u2!=0
- so if the significant value is 0.05 then we can say that both the averages are same.

### 2 Sample Mean Test :Unpaired

In [21]:
df = pd.read_excel('2-sample mean test.xlsx',sheet_name="2-sample mean test - Unpaired")

In [22]:
df.head()

,Unnamed: 0,Commute time of Team 1,Commute Time of Team 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,NaN,27,18,NaN,NaN,NaN
1,NaN,43,27,t-Test: Two-Sample Assuming Unequal Variances,NaN,NaN
2,NaN,34,64,NaN,NaN,NaN
3,NaN,24,61,NaN,Variable 1,Variable 2
4,NaN,31,13,Mean,34,41.875

In [23]:
df = df[['Commute time of Team 1','Commute Time of Team 2']]

In [25]:
scipy.stats.ttest_rel(df['Commute time of Team 1'],df['Commute Time of Team 2'])

TtestResult(statistic=-2.925210034347082, pvalue=0.006386438954034741, df=31)

- H0: u1-u2=0
- So in this case p value=0.006
- Taking the significance value as 0.05
- p- value is < alpha value. Therefore we will reject null hypothesis